src/cf/Documents/ПередачаДелВАрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПередачаДелВАрхив</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДелХраненияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыгрузкиВАрхив</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаСАрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДелаХраненияДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДелоХраненияДокументов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияДелХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДелХраненияДокументов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДелХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДелоХраненияДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеВнутреннихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеВнутреннихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиЭП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарегистрировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентыДляСписков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подготовил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанВсеми</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанУтвержден</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнийЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыОбработкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерИДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержитОригинал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭДОДокументооборот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Ожидаемый срок ответа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокКонтроляОбщий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЭП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПроверкиЭП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сторона1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сторона2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧисловойНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСортировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПередачаДелВАрхив/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДелаХраненияДокументов.Ссылка КАК Дело,
		|	ДелаХраненияДокументов.Организация КАК Организация,
		|	ДелаХраненияДокументов.Подразделение КАК Подразделение,
		|	ДелаХраненияДокументов.ДелоЗакрыто КАК ДелоЗакрыто,
		|	НоменклатураДелСпр.ФормаДокументов КАК ФормаДокументов
		|ИЗ
		|	Справочник.ДелаХраненияДокументов КАК ДелаХраненияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК НоменклатураДелСпр
		|		ПО ДелаХраненияДокументов.НоменклатураДел = НоменклатураДелСпр.Ссылка
		|ГДЕ
		|	ДелаХраненияДокументов.Ссылка В(&Дела)");
	
	Запрос.УстановитьПараметр("Дела", ДелаХраненияДокументов.ВыгрузитьКолонку("ДелоХраненияДокументов"));
	ЗначенияРеквизитовДел = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураРеквизитов = Новый Структура("Организация, Подразделение, ФормаДокументов, ДелоЗакрыто");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		ЗначенияРеквизитовДел[Выборка.Дело] = СтруктураРеквизитов;
	КонецЦикла;
	
	ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
	ВключенаИнтеграцияСАрхивом = ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом");
	
	Для Каждого Строка Из ДелаХраненияДокументов Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ДелоХраненияДокументов) Тогда
			Продолжить;
		КонецЕсли;
			
		РеквизитыДела = ЗначенияРеквизитовДел[Строка.ДелоХраненияДокументов];
		
		Если ИспользоватьУчетПоОрганизациям И РеквизитыДела.Организация <> Организация Тогда 
			ТекстСообщения = СтрШаблон(РедакцииКонфигурацииКлиентСервер.ОшибкаПередачаДелВАрхив(),
				Строка.ДелоХраненияДокументов, Организация);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) И РеквизитыДела.Подразделение <> Подразделение Тогда 
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Дело ""%1"" не относится к подразделению ""%2"".'"),
				Строка.ДелоХраненияДокументов, Подразделение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
		Если РеквизитыДела.ФормаДокументов <> ФормаДокументов Тогда 
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Дело ""%1"" не соответствует выбранной форме ""%2"".'"),
				Строка.ДелоХраненияДокументов, ФормаДокументов);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
		Если РеквизитыДела.ДелоЗакрыто = Ложь Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" не закрыто.'"),
				Строка.ДелоХраненияДокументов);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВключенаИнтеграцияСАрхивом И СтатусВыгрузкиВАрхив = Перечисления.СтатусыОбменаСАрхивом.ГотовКВыгрузке Тогда
		ЛимитКоличестваСообщений = 10;
		Сообщений = 0;
		ОшибкиЗаполненияВДокументах = ПроверитьЗаполнениеОбязательныхРеквизитовДляВыгрузкиВАрхив();
		Для Каждого ТекстОшибки Из ОшибкиЗаполненияВДокументах Цикл
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
			Сообщений = Сообщений + 1;
			Если Сообщений = ЛимитКоличестваСообщений Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = '... еще %1 ошибок в документах'"),
					Формат(ОшибкиЗаполненияВДокументах.Количество() - ЛимитКоличестваСообщений, "ЧГ="));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Сообщений = 0;
		ОшибкиЭП = ПроверитьЭПДокументовДляВыгрузкиВАрхив();
		Для Каждого ТекстОшибки Из ОшибкиЭП Цикл
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
			Сообщений = Сообщений + 1;
			Если Сообщений = ЛимитКоличестваСообщений Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = '... еще %1 ошибок в электронных подписях документов'"),
					Формат(ОшибкиЭП.Количество() - ЛимитКоличестваСообщений, "ЧГ="));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		Дата = ТекущаяДатаСеанса();
		ДатаСоздания = ТекущаяДатаСеанса();
		Создал = Пользователи.ТекущийПользователь();
		Если Не ЗначениеЗаполнено(Организация) Тогда 
			Организация = РаботаСОрганизациями.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") = Истина Тогда
			СтатусВыгрузкиВАрхив = Перечисления.СтатусыОбменаСАрхивом.НеГотовКВыгрузке;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		
		ЗначенияРеквизитовДел = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			ДанныеЗаполнения, "ФормаДокументов, Организация, Подразделение");
		
		ФормаДокументовДел = Неопределено;
		ОрганизацияДел = Неопределено;
		ПодразделениеДел = Неопределено;
		НесколькоПодразделений = Ложь;
		
		Для Каждого ДелоТом Из ДанныеЗаполнения Цикл
			
			РеквизитыДела = ЗначенияРеквизитовДел[ДелоТом];
			
			Если ФормаДокументовДел = Неопределено Тогда
				ФормаДокументовДел = РеквизитыДела.ФормаДокументов;
			КонецЕсли;
			Если ОрганизацияДел = Неопределено Тогда
				ОрганизацияДел = РеквизитыДела.Организация;
			КонецЕсли;
			Если РеквизитыДела.ФормаДокументов <> ФормаДокументовДел
				Или РеквизитыДела.Организация <> ОрганизацияДел Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПодразделениеДел = Неопределено Тогда
				ПодразделениеДел = РеквизитыДела.Подразделение;
			ИначеЕсли ПодразделениеДел <> РеквизитыДела.Подразделение Тогда
				НесколькоПодразделений = Истина;
			КонецЕсли;
			
			НоваяСтрока = ДелаХраненияДокументов.Добавить();
			НоваяСтрока.ДелоХраненияДокументов = ДелоТом;
			
		КонецЦикла;
		
		ФормаДокументов = ФормаДокументовДел;
		Организация = ОрганизацияДел;
		Если Не НесколькоПодразделений Тогда
			Подразделение = ПодразделениеДел;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СостоянияДелХраненияДокументов.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДелаТабЧасть.НомерСтроки КАК НомерСтроки,
		|	&ДатаДокумента КАК Период,
		|	ДелаСпр.Ссылка КАК Дело,
		|	ДелаСпр.МестоХраненияДел КАК МестоХранения,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияДелХраненияДокументов.ПереданоВАрхив) КАК Состояние,
		|	СостоянияСрезПоследних.Состояние КАК СостояниеРанее
		|ИЗ
		|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ДелаТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелаХраненияДокументов КАК ДелаСпр
		|		ПО ДелаТабЧасть.ДелоХраненияДокументов = ДелаСпр.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДелХраненияДокументов.СрезПоследних(&Период, ДелоХраненияДокументов В
		|		(&ПереданныеДела)) КАК СостоянияСрезПоследних
		|		ПО ДелаТабЧасть.ДелоХраненияДокументов = СостоянияСрезПоследних.ДелоХраненияДокументов
		|ГДЕ
		|	ДелаТабЧасть.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПереданныеДела",
		ДелаХраненияДокументов.ВыгрузитьКолонку("ДелоХраненияДокументов"));
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СостояниеРанее = Перечисления.СостоянияДелХраненияДокументов.ПереданоВАрхив Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" было передано в архив ранее.'"),
				Выборка.Дело);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		ИначеЕсли Выборка.СостояниеРанее = Перечисления.СостоянияДелХраненияДокументов.Уничтожено Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" было уничтожено ранее.'"),
				Выборка.Дело);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;	
		
		Движение = Движения.СостоянияДелХраненияДокументов.Добавить();
		Движение.Период = Выборка.Период;
		Движение.ДелоХраненияДокументов = Выборка.Дело;
		Движение.Состояние = Выборка.Состояние;
		Движение.Активность = Не Ссылка.ПометкаУдаления;
		
		// Зафиксируем состояние передачи в архив для всех документов в делах.
		Делопроизводство.ЗаписатьСостояниеДелаВДокументы(Выборка.Дело, Выборка.Состояние);
		
		// Очистка места хранения.
		Если ЗначениеЗаполнено(Выборка.МестоХранения) Тогда
			ЗаблокироватьДанныеДляРедактирования(Выборка.Дело);
			ДелоОбъект = Выборка.Дело.ПолучитьОбъект();
			ДелоОбъект.МестоХраненияДел = Неопределено;
			ДелоОбъект.Записать();
			РазблокироватьДанныеДляРедактирования(Выборка.Дело);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") = Истина Тогда
			АрхивныеОперацииСервер.ОбработатьПередачуДокументовВАрхив(Выборка.Дело, Дата);
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") = Истина Тогда
		Если Не ДополнительныеСвойства.Свойство("ИнтеграцияДокументаСАрхивом") Тогда
			ТекстСообщения = НСтр("ru = 'Включена интеграция с 1С:Архивом. Отменить проведение невозможно.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
				ЭтотОбъект, "СтатусВыгрузкиВАрхив",, Отказ);
			Возврат;
		КонецЕсли;
		АрхивныеОперацииСервер.ОтменитьПередачуДокументовВАрхив(Ссылка);
	КонецЕсли;
	
	// Отменим состояние передачи в архив для всех документов в делах.
	Для Каждого СтрДело Из ДелаХраненияДокументов Цикл
		Делопроизводство.ЗаписатьСостояниеДелаВДокументы(СтрДело.ДелоХраненияДокументов, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Создал) Тогда
		Создал = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") = Истина
		И Не ДополнительныеСвойства.Свойство("ИнтеграцияДокументаСАрхивом")
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекстСообщения = НСтр("ru = 'Включена интеграция с 1С:Архивом. Проведение невозможно.'");
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"СтатусВыгрузкиВАрхив",,
			Отказ);
	КонецЕсли;
		
	Если СтатусВыгрузкиВАрхив = Перечисления.СтатусыОбменаСАрхивом.ГотовКВыгрузке Тогда
		Передал = Пользователи.ТекущийПользователь();
		ДатаПередачи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
		
КонецПроцедуры

Функция ПроверитьЗаполнениеОбязательныхРеквизитовДляВыгрузкиВАрхив()
	
	МассивОшибок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеВнутреннихДокументов.ДатаРегистрации КАК ДатаРегистрации,
		|	ДанныеВнутреннихДокументов.РегистрационныйНомер КАК РегистрационныйНомер,
		|	ДанныеВнутреннихДокументов.Организация КАК Организация,
		|	ДанныеВнутреннихДокументов.Документ КАК Ссылка,
		|	ДанныеВнутреннихДокументов.Дело КАК Дело
		|ИЗ
		|	РегистрСведений.ДанныеВнутреннихДокументов КАК ДанныеВнутреннихДокументов
		|ГДЕ
		|	ДанныеВнутреннихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеВнутреннихДокументов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВходящихДокументов.ДатаРегистрации,
		|	ДанныеВходящихДокументов.РегистрационныйНомер,
		|	ДанныеВходящихДокументов.Организация,
		|	ДанныеВходящихДокументов.Документ,
		|	ДанныеВходящихДокументов.Дело
		|ИЗ
		|	РегистрСведений.ДанныеВходящихДокументов КАК ДанныеВходящихДокументов
		|ГДЕ
		|	ДанныеВходящихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеВходящихДокументов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеИсходящихДокументов.ДатаРегистрации,
		|	ДанныеИсходящихДокументов.РегистрационныйНомер,
		|	ДанныеИсходящихДокументов.Организация,
		|	ДанныеИсходящихДокументов.Документ,
		|	ДанныеИсходящихДокументов.Дело
		|ИЗ
		|	РегистрСведений.ДанныеИсходящихДокументов КАК ДанныеИсходящихДокументов
		|ГДЕ
		|	ДанныеИсходящихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеИсходящихДокументов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПереданныеДела",
		ДелаХраненияДокументов.ВыгрузитьКолонку("ДелоХраненияДокументов"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
			МассивОшибок.Добавить(
				СтрШаблон(НСтр("ru = 'Не заполнено поле ""Дата регистрации"" документа ""%1"" в деле ""%2"".'"),
					Выборка.Ссылка, Выборка.Дело));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.РегистрационныйНомер) Тогда
			МассивОшибок.Добавить(
				СтрШаблон(НСтр("ru = 'Не заполнено поле ""Регистрационный номер"" документа ""%1"" в деле ""%2"".'"),
					Выборка.Ссылка, Выборка.Дело));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.Организация) Тогда
			МассивОшибок.Добавить(
				СтрШаблон(НСтр("ru = 'Не заполнено поле ""Организация"" документа ""%1"" в деле ""%2"".'"),
					Выборка.Ссылка, Выборка.Дело));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции

Функция ПроверитьЭПДокументовДляВыгрузкиВАрхив()
	
	МассивОшибок = Новый Массив; 
	
	// Документы ДО.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДанныеВнутреннихДокументов.Документ КАК Документ,
		|	ДанныеВнутреннихДокументов.Дело КАК Дело
		|ИЗ
		|	РегистрСведений.ДанныеВнутреннихДокументов КАК ДанныеВнутреннихДокументов
		|ГДЕ
		|	ДанныеВнутреннихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеВнутреннихДокументов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВходящихДокументов.Документ,
		|	ДанныеВходящихДокументов.Дело
		|ИЗ
		|	РегистрСведений.ДанныеВходящихДокументов КАК ДанныеВходящихДокументов
		|ГДЕ
		|	ДанныеВходящихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеВходящихДокументов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеИсходящихДокументов.Документ,
		|	ДанныеИсходящихДокументов.Дело
		|ИЗ
		|	РегистрСведений.ДанныеИсходящихДокументов КАК ДанныеИсходящихДокументов
		|ГДЕ
		|	ДанныеИсходящихДокументов.Дело В(&ПереданныеДела)
		|	И ДанныеИсходящихДокументов.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ПереданныеДела",
		ДелаХраненияДокументов.ВыгрузитьКолонку("ДелоХраненияДокументов"));
		
	ДокументыДО = Новый Массив;
	ДелаДокументов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументыДО.Добавить(Выборка.Документ);
		ДелаДокументов[Выборка.Документ] = Выборка.Дело;
		
		РаботаСЭП.ПередЧтениемЭПДокументаДО(Выборка.Документ);
		
	КонецЦикла;
	
	// Проверка ЭП файлов, кроме ЭДО.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.ВладелецФайла КАК Документ,
		|	Файлы.Ссылка КАК Файл,
		|	ЭП.КомуВыданСертификат КАК КомуВыданСертификат
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|		ПО Файлы.ТекущаяВерсия = ЭП.ПодписанныйОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ПО (СлужебныеФайлыДокументов.Файл = Файлы.Ссылка)
		|ГДЕ
		|	Файлы.ВладелецФайла В (&ДокументыДО)
		|	И СлужебныеФайлыДокументов.Файл ЕСТЬ NULL
		|	И НЕ ЭП.ПодписьВерна
		|	И ЭП.ДатаПроверкиПодписи <> ДАТАВРЕМЯ(1, 1, 1)");
	Запрос.Параметры.Вставить("ДокументыДО", ДокументыДО);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОшибок.Добавить(СтрШаблон(НСтр("ru = 'Недействительная подпись файла ""%1"" документа ""%2"" в деле ""%3"", подписал ""%4""'"),
			Выборка.Файл, Выборка.Документ, ДелаДокументов[Выборка.Документ], Выборка.КомуВыданСертификат));
	КонецЦикла;
	
	// Документы ЭДО.
	ДокументыЭДОПоДокументамДО = ОбменСКонтрагентамиДОСлужебный.ДокументыЭДОДокументовДО(ДокументыДО);
	ВсеДокументыЭДО = Новый Массив;
	ДокументыДОПоДокументамЭДО = Новый Соответствие;
	Для Каждого КлючИЗначение Из ДокументыЭДОПоДокументамДО Цикл
		ДокументДО = КлючИЗначение.Ключ;
		МассивЭДО = КлючИЗначение.Значение;
		Для Каждого ДокументЭДО Из МассивЭДО Цикл
			ВсеДокументыЭДО.Добавить(ДокументЭДО);
			ДокументыДОПоДокументамЭДО[ДокументЭДО] = ДокументДО;
		КонецЦикла;
	КонецЦикла;
	
	Если ВсеДокументыЭДО.Количество() = 0 Тогда
		Возврат МассивОшибок;
	КонецЕсли;
	
	ТаблицаФайловЭДО = ЭлектронныеДокументыЭДО.ПрисоединенныеФайлыЭлектронныхДокументов(ВсеДокументыЭДО);
	ФайлыЭДО = ТаблицаФайловЭДО.ВыгрузитьКолонку("ПрисоединенныйФайл");
	
	РаботаСЭП.ПередЧтениемЭПОбъектов(ФайлыЭДО);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭП.ПодписанныйОбъект КАК Файл,
		|	ЭП.КомуВыданСертификат КАК КомуВыданСертификат
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|ГДЕ
		|	ЭП.ПодписанныйОбъект В (&ФайлыЭДО)
		|	И НЕ ЭП.ПодписьВерна
		|	И ЭП.ДатаПроверкиПодписи <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.Параметры.Вставить("ФайлыЭДО", ФайлыЭДО);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденнаяСтрока = ТаблицаФайловЭДО.Найти(Выборка.Файл, "ПрисоединенныйФайл");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДокументДО = ДокументыДОПоДокументамЭДО[НайденнаяСтрока.ЭлектронныйДокумент];
		МассивОшибок.Добавить(СтрШаблон(НСтр("ru = 'Недействительная подпись файла ""%1"" документа ""%2"" в деле ""%3"", подписал ""%4""'"),
			Выборка.Файл, ДокументДО, ДелаДокументов[ДокументДО], Выборка.КомуВыданСертификат));
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
